def area(a, b): 

    """
    Фуркнция вычесления площади с заданными сторонами a, b

    принимает параметр:  a (int): первая сторона
                         b (int): вторая сторона 
    
    возвращает: площадь (int)
    """

    return a * b 

def perimeter(a, b): 

    """
    Функция вычесления периметр с заданными сторонами a, b

    принимает параметр:  a (int): первая сторона
                         b (int): вторая сторона 
    
    возвращает: периметр (int)
    """

    return 2 *(a + b) 