def area(a, h): 

    """
    функция вычесления площади с заданной стороной a и высотой h

    принимает парметры:  a (int): сторона
                         h (int): высота
    
    возвращает: площадь (int)

    Пример вызова:
    area(4, 3)
    """

    return a * h / 2 

def perimeter(a, b, c): 
    
    """
    функция вычесления периметра с заданной стороной a

    принимает парметр:  a (int): сторона 1
                        b (int): сторона 2
                        c (int): сторона 3
    
    возвращает: периметр (int)
    
    Пример вызова:
    perimeter(3, 4, 5)
    """

    return a + b + c 